[
  {
    "name": "The Association of Women in EE & CS (AWE)",
    "website": "http://awe.berkeley.edu",
    "eecs_summary": "Formerly AUWICSEE. aweberkeley@gmail.com AWE is a supportive community at UC Berkeley that seeks to empower women pursuing Computer Science and/or Electrical Engineering. AWE provides exposure to industry and research opportunities, as well as space to connect with each other, by hosting various academic, social, and professional events throughout the academic year.",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "https://awe.studentorg.berkeley.edu/home",
    "has_about_page": true,
    "full_content": "AWE is a student-run organization at UC Berkeley that seeks to empower female and non-binary undergraduate students pursuing Computer Science and/or Electrical Engineering disciplines. AWE hosts a variety of academic, industry, and social events throughout the year to support and connect our members. Previous Uber Infosession Spring '24 General Meeting Fall '22 Atlassian Field Trip Spring '23 Tote Bag Painting Fall '22 AWE-fficer Retreat Newspace Industry Speaker Uber Infosession Spring '24 General Meeting Fall '22 Atlassian Field Trip Spring '23 Tote Bag Painting Fall '22 AWE-fficer Retreat Newspace Industry Speaker Uber Infosession Spring '24 General Meeting Next123456 What does it mean to be an AWE member? AWE members are welcome to the socials, technical workshops, company events, and all other kinds of events hosted throughout the year. Members stay in touch through our club-wide Slack, and receive opportunities through our weekly newsletter and resume book. We also encourage members to join our mentorship program to give back and get involved! Our office is open as a study space and a social space for members during AWE-ffice hours.Being a part of AWE means joining a community of inspiring and supportive women and non-binary individuals in EE&CS here at Berkeley. Learn more about membership here! Become a member! If you’re a graduated member of AWE, please join our AWE-lumni community and Slack workspace! Refer to the #awelumni channel in the AWE slack for more info on how to join. Check out our Instagram! awe.berkeley AWE is a student-run organization at UC Berkeley that empowers womxn and non-binary undergrads interested in tech. ✨ Join us for AWE’s first General Meeting on M Please join AWE, SWE and CSK for a joint EECS Gend Today!! Join us at the woz from 1-3PM and speak w Join us for our End of the Year Banquet & Showcase AWE is hosting a graduation photoshoot for all AWE In celebration of Pan-American day, AWE is hosting Load More Follow on Instagram",
    "status": "success"
  },
  {
    "name": "Bias Busters",
    "website": "https://biasbusters.berkeley.edu/",
    "eecs_summary": "biasbusters-admin@lists.eecs.berkeley.edu Bias Busters is an organization run by students, faculty, and staff to address implicit bias issues in the EECS department. Our goal is to make our department welcoming and inclusive to all, helping us to continue to be one of the best departments in the nation.",
    "email": "biasbusters-admin@lists.eecs.berkeley.edu",
    "scraped_url": "https://biasbusters.berkeley.edu/about/",
    "has_about_page": true,
    "full_content": "Home > AboutAbout Bias Busters is an organization run by graduate students, faculty, and staff to address implicit bias issues in our community. Our goal is to make our campus welcoming and inclusive to all, helping us to continue to be one of the best universities in the nation. Implicit biases are biases we are unaware of and that happen outside our control. They are triggered by our brain making quick assessments of the situations around us and are influenced by our background, cultural environment, and personal experiences. Everyone has unconscious biases – that’s how our brains work! But while fast thinking can make our brains more efficient, it can also be detrimental in a diverse working environment if we make snap judgments about our colleagues. We have talked to people from across the department about their experiences. The BiasBusters workshops are designed around your feedback, discussing implicit bias, stereotype threat, and how bystander intervention can help interrupt bias and make our community a better place for everyone to learn and work. As future technology and innovation leaders, all department members should strive to make our working environment the most inclusive and effective possible. BiasBusters wants to provide the tools to help us all build a more inclusive future together! BiasBusters is based on BiasBusters @ CMU and Google’s Bias Busting @ Work programs.",
    "status": "success"
  },
  {
    "name": "Black Engineering and Science Student Association (BESSA)",
    "website": "http://ucberkeleybessa.com",
    "eecs_summary": "ucberkeleybessa@gmail.com",
    "email": "biasbusters-admin@lists.eecs.berkeley.edu",
    "scraped_url": "http://ucberkeleybessa.com/about-us.html",
    "has_about_page": true,
    "full_content": "​The Black Engineering and Science Student Association, also known as BESSA, is the University of California, Berkeley chapter for our parent organization the National Society of Black Engineers (NSBE). We are a student run, non-profit organization that thrives on its members support, success, and commitment. We diligently work to provide academic and social support not only to our engineering and science community but to the entire black community. In addition, we happily coordinate programs during the year to integrate our greater Bay Area community. Through these events, we are able to form and foster relationships that bridge the gap between the prestigious university and our close-but-distant community. This organization is a strong believer in academic excellence, personal growth, and a commitment to minority communities in and out of the classroom.Our Mission Statement: \"To increase the number of culturally responsible black engineers and scientists who excel academically, succeed professionally, and positively impact the community.\"Our Objectives:Retain, support, and increase the number of black students within the College of Engineering (COE) as well as other science, technology, engineering, and math (STEM) fields.Introduce and develop the professional skills needed to succeed in the professional field.Cultivate a network between students, professionals, and companies. Give our greater community access to our resources for support in areas that are lacking.",
    "status": "success"
  },
  {
    "name": "Blockchain at Berkeley",
    "website": "https://blockchain.berkeley.edu/",
    "eecs_summary": "admin@blockchain.berkeley.edu Blockchain at Berkeley is a university-based organization out of UC Berkeley dedicated to serving the crypto and blockchain communities. Our members comprise of 60+ active undergraduate and graduate students from Berkeley Engineering, Haas, and Berkeley Law, and a wealth of advisors from both industry and academia. We primarily focus on developing blockchain solutions as part of our consulting department for Fortune 500 companies, with our capabilities ranging from Proof of Concepts to advisory and consultancy. We also offer on and off-campus courses through our education department that range from offering fundamental know-how of the blockchain space to skills for developers to have the means to become a full-stack blockchain developer. Visit us at blockchain.berkeley.edu if you are interested in learning more about us.",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "https://blockchain.berkeley.edu/about",
    "has_about_page": true,
    "full_content": "Blockchain at Berkeley drives innovation in the blockchain industry by building an ecosystem that empowers students to make an impact through practical education, consulting for enterprise companies, and conducting open source research.",
    "status": "success"
  },
  {
    "name": "Cloud at Cal",
    "website": "https://sites.google.com/berkeley.edu/cloudatcal",
    "eecs_summary": "cloudatcal@gmail.com Cloud at California is UC Berkeley’s Largest Cloud Computing Organization and provides UC Berkeley students with opportunities to learn and apply cloud technologies. Members develop hands-on skills in cloud infrastructure, data analytics, machine learning, and more through workshops and consulting projects. In the past, we have worked with companies including Amazon and Accenture, as well as research labs in UCSF and MIT. We aim to provide our members with academic and real-world industry experience in a wide range of computer science fields, to become well-rounded researchers and developers.",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "https://sites.google.com/berkeley.edu/cloudatcal",
    "has_about_page": false,
    "full_content": "Cloud at CaliforniaUC Berkeley's Cloud Computing Organization",
    "status": "success"
  },
  {
    "name": "EECS Transfers at Berkeley",
    "website": "https://callink.berkeley.edu/organization/eecstransfers",
    "eecs_summary": "EECS Transfers at Berkeley aims to build a community and provide resources to better ensure academic success and career readiness for transfer students interested in the fields of EECS & CS. We try to create an open and fun environment where anyone with any skill level can join us!",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "https://callink.berkeley.edu/organization/eecstransfers",
    "has_about_page": false,
    "full_content": "EECS Transfers at BerkeleyAboutEECS Transfers at Berkeley aims to build a community and provide resources to better ensure academic success and career readiness for transfer students interested in the field of electrical engineering and computer sciences. Contact Information Address Contact Email E: contact@eecstransfers.studentorg.berkeley.edu Additional Information INFORMATION ABOUT HOW TO GET INVOLVED WITH THIS ORGANIZATION IS FOUND HERE Visit our website for more infoFind information below about the OASIS Center organization category and who the administration contact is (see https://lead.berkeley.edu/meet-our-staff/):Callink DesignationOASIS Category: Engineering/Computer Science RSOUndergraduate/Graduate Student CompositionUndergraduate Students Primary Campus AdvisorMelissa Landeros at melissalanderos@berkeley.eduAdditional Advisor, if applicable. Some groups benefit from having assigned advisors across units. This relationship can be informal or formal. If formal, the advisor name appears here:Not ApplicableContactSign In To View OfficersDocumentsConstitution/BylawsConstitution/BylawsConstitution/Bylaws",
    "status": "success"
  },
  {
    "name": "Eta Kappa Nu (HKN) EECS Honor Society",
    "website": "http://hkn.eecs.berkeley.edu/",
    "eecs_summary": "hkn@hkn.eecs.berkeley.edu Eta Kappa Nu (HKN) is the Electrical Engineering and Computer Sciences honor society. The Berkeley (Mu) chapter is among the most active engineering societies at Cal, providing a variety of services to the students and staff at Berkeley. We offer free drop-in tutoring in both of our offices, 345 Soda and 290 Cory, from 11am to 5pm Mondays through Fridays. Many resources can be found on our website, such as course guides, an archive of past examinations, and semesterly evaluations of all EECS classes. Besides activities on campus, HKN also helps with many community service events to give back to the surrounding neighborhood. In addition, HKN has a long history of assisting companies in coordinating infosessions and career fairs. Membership in Eta Kappa Nu is extended to the top fourth of the junior class and the top third of the senior class in the EECS department.",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "http://hkn.eecs.berkeley.edu/",
    "has_about_page": false,
    "full_content": "Log In | Register guest Student Services Industry Relations Events Service Alumni About HKN Tutoring Hours Review Sessions Exam Archive Course Surveys Course Guide Department Tours Why HKN? Resume Books Infosessions Career Fair Contact Us Events Calendar Upcoming Events Past Events Service Junior EECS Day Maker Workshops EECS Day Bearhacks Cal Day Workshops Alumni Contact Information Contact Information Photo Gallery Yearbooks Slideshows Current Officers Current Committee Members Tutoring Hours Review Sessions Exam Archive Course Surveys Course Guide Department Tours Why HKN? Resume Books Infosessions Career Fair Contact Us Events Calendar Upcoming Events Past Events Service Junior EECS Day Maker Workshops EECS Day Bearhacks Cal Day Workshops Alumni Contact Information Contact Information Photo Gallery Yearbooks Slideshows Current Officers Current Committee Members example: CS 61a, ee 20, cs 188 example: Hilfinger, hilf*, cs 61a Upcoming Events view all upcoming events | view events calendar Tutoring and Classes view academic calendar Monday's Tutoring Schedule weekly schedule Times(Pacific) Cory 290 Soda 345 ProDev OH (Cory 290)No class tutoring 12PM-1PM No Tutoring! No Tutoring! 1PM-2PM Nidhya Shivakumar Nidhya Shivakumar Tutoring Office Hours: Monday, 1-2 @ Cory Current: CS61A, CS61B Kourosh Salahi Kourosh Salahi Tutoring Office Hours: Monday, 1-2 @ Soda Preferred: CS61A, CS61B, CS70, CS170 Completed: EECS16A, EECS16B, CS61C, EE120 Current: EECS126, CS189 Jacob Deleon Jacob Deleon Tutoring Office Hours: Monday, 1-2 @ Soda Monday, 2-3 @ Soda Preferred: PHYS7A, PHYS7B, EECS16B, CS61B, EE105 Completed: MATH1A, MATH1B, PHYS7C, EECS16A, CS61A, CS61C, EE117 Current: EE130, EE140 2PM-3PM Aaron Zheng Aaron Zheng Tutoring Office Hours: Monday, 2-3 @ Cory Preferred: EECS16A, EECS16B, CS61A, CS61B, CS70, EE120, CS180, CS184, CS189 Jaewon Hur Jaewon Hur Tutoring Office Hours: Friday, 4-5 @ Cory Monday, 2-3 @ Soda Current: EECS16A, EECS16B, CS61A, CS61B Jacob Deleon Jacob Deleon Tutoring Office Hours: Monday, 1-2 @ Soda Monday, 2-3 @ Soda Preferred: PHYS7A, PHYS7B, EECS16B, CS61B, EE105 Completed: MATH1A, MATH1B, PHYS7C, EECS16A, CS61A, CS61C, EE117 Current: EE130, EE140 Juhyun Do Juhyun Do Tutoring Office Hours: Monday, 2-3 @ Soda 3PM-4PM Skylar Qian Skylar Qian Tutoring Office Hours: Monday, 3-4 @ Cory Tiger Zhang Tiger Zhang Tutoring Office Hours: Monday, 3-4 @ Soda Monday, 4-5 @ Soda Preferred: EECS126, EECS127, CS161, CS170, CS189 Completed: PHYS7B, PHYS7C, EECS16A, EECS16B, MATH53, CS61A, CS61B, CS61C Current: CS180, CS182 Alex Mehta Alex Mehta Tutoring Office Hours: Monday, 3-4 @ Soda Completed: EECS16A, CS61A, CS61B, EE120 Current: EECS16B, CS61C, CS70 4PM-5PM Simon Starbuck Simon Starbuck Tutoring Office Hours: Monday, 4-5 @ Cory Thursday, 1-2 @ Cory Preferred: PHYS7B, PHYS7C, MATH53, CS61A, EE130 Completed: MATH1A, MATH1B, PHYS7A, EECS16A, EECS16B Current: CS61B, CS70, EE143 Andrew Seymour Andrew Seymour Tutoring Office Hours: Monday, 4-5 @ Soda Tuesday, 4-5 @ Soda Current: EECS149, CS194 Tiger Zhang Tiger Zhang Tutoring Office Hours: Monday, 3-4 @ Soda Monday, 4-5 @ Soda Preferred: EECS126, EECS127, CS161, CS170, CS189 Completed: PHYS7B, PHYS7C, EECS16A, EECS16B, MATH53, CS61A, CS61B, CS61C Current: CS180, CS182 MATH 1A , 1B , 53 PHYS 7A , 7B , 7C EECS 16A , 16B , 126 , 127 , 149 CS 61A , 61B , 61C , 70 , 161 , 170 , 180 , 182 , 184 , 189 , 194 EE 105 , 117 , 120 , 130 , 140 , 143 = preferred = completed = in progress What is HKN? Eta Kappa Nu (HKN) is the national Electrical and Computer Engineering honor society. The Berkeley chapter is among the most active engineering societies at Berkeley, providing academic services to fellow undergraduates. Our two offices are located in 290 Cory and 345 Soda near the northeastern corner of the UC Berkeley campus. Student Services Tutoring Students who need advice or tutoring in EE and CS courses are encouraged to drop by for free assistance. Officers hold office hours from 11am to 5pm every weekday. Exam Preparation HKN provides a database of past exams and review problems to prepare students for midterms and finals. In addition, look out for exam review sessions for lower-division courses. Course Surveys and Peer Advising HKN conducts course surveys for all classes offered by the EECS department every semester. The results for all professors and TAs who have opted-in are available online. Students who need more advice in choosing classes are encouraged to consult our officers during office hours. Industrial Relations HKN has strong ties with industry, linking students with companies by setting up info sessions where companies can give a presentation about themselves and provide a forum for students to talk to industry and find out more about the work environment. Additionally, we sell resume books containing the resumes of our members. Membership Membership in Eta Kappa Nu is extended to undergraduates in the top fourth of the junior class and the top third of the senior class in EECS, and all continuing EE graduate students. Interested students should watch for the list of eligible names, which is posted around Cory Hall and Soda Hall about a month after the beginning of each semester. After being invited to join, prospective members participate in projects and social activities that demonstrate their dedication to serving fellow members of the EECS community, the ultimate goal of HKN. Eta Kappa Nu, Mu Chapter HOME | CONTACT",
    "status": "success"
  },
  {
    "name": "Graduates for Engaged and Extended Scholarship around Computing & Engineering (GEESE)",
    "website": "http://geesegraduates.org/",
    "eecs_summary": "geese-org@lists.berkeley.edu GEESE aims to address growing concerns around the rapid advancement and integration of technologies by building a campus community of graduate students and postdocs that brings together disciplines and perspectives to promote cross-disciplinary and engaged scholarship on issues that cannot be purely addressed from the silos of our individual fields.",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "http://www.bluehost.com/cgi/info/about_us",
    "has_about_page": true,
    "full_content": "All about Bluehost. Since our founding in 2003, Bluehost has offered web hosting solutions that continually innovate new ways to deliver on our mission: empowering people to harness their brands online. Comprehensive tools for all WordPress.org-recommended Trusted by 2M users close Free Domain Policy If your hosting plan comes with a free domain through Bluehost and you cancel within the first year, please note there is a non-refundable domain fee based on the regular cost of the domain, which can be found in your control panel, plus any applicable fees, for the domain name. The fee not only covers our own costs, but it ensures that, even if you're dissatisfied with your experience at Bluehost, you won't lose your domain name. Upon payment of the domain fee, you'll be free to transfer it or simply point it elsewhere. Please note, however, that newly registered domains cannot be transferred to another registrar during the first 60 days of the registration period. If you elect to renew your domain name, you will retain ownership of the domain name until the end of its registration period. ,If your hosting plan comes with a free domain through Bluehost and you cancel within the first year, please note there is a non-refundable domain fee based on the regular cost of the domain, which can be found in your control panel, plus any applicable fees, for the domain name. The fee not only covers our own costs, but it ensures that, even if you're dissatisfied with your experience at Bluehost, you won't lose your domain name. Upon payment of the domain fee, you'll be free to transfer it or simply point it elsewhere. Please note, however, that newly registered domains cannot be transferred to another registrar during the first 60 days of the registration period. If you elect to renew your domain name, you will retain ownership of the domain name until the end of its registration period. We’re here to help you get online. Bluehost is a leading web hosting provider empowering millions of websites worldwide. Discover how Bluehost's expertise, reliability, and innovation can help you achieve your online goals. Learn more today. Who we are. We’re the longest-running WordPress.org recommended host, supported by the world’s most popular site builder. We provide comprehensive tools globally so anyone, novice or pro, can thrive online. What we do. We believe in creating a better, safer web for everyone. We fight spammers, block unwanted pornography, and invest in countless open-source projects to push projects to their full potential. Powerful hosting and services. Fast, reliable, and packed with features, our WordPress hosting options are designed to fit your needs. Online Store Backed by WooCommerce and Yith, you can build an online store and start selling now. WordPress Hosting Blog, website, or online store, we’ve got a WordPress Hosting plan that fits your goals perfectly. Web Hosting Get all the features, tools, and guidance you need to build and launch impressive sites with a Web Hosting plan. Professional services. Professional Web Design Let us design your website from start to finish. We build what you need so you can stay focused on what you do best. Professional Digital Marketing Get found online and attract more visitors while we do the work! From SEO to PPC campaigns, we do all the marketing. Website Migration Service Your site can be the first impression of your business. Start off right with a clean, simple, and mobile-friendly site. Support and guidance. Bluehost supports millions of websites worldwide. Let our experts help you build, grow and manage your WordPress website. Call 888-401-4678 or Chat Now Learn even more about Bluehost. Contact Have questions about getting on the web? We're always standing by and ready to help. Learn more Careers See if joining the Bluehost family is right for you. Check out available positions today! Learn more Blog The latest tech news, updates, and insider tips—straight from the experts. Learn more",
    "status": "success"
  },
  {
    "name": "Machine Learning at Berkeley (ML@B)",
    "website": "http://ml.berkeley.edu/",
    "eecs_summary": "contact@ml.berkeley.edu Machine Learning at Berkeley (ML@B) is the premiere data science and machine learning student organization at UC Berkeley. Our goal is to build a community around ML while bridging the gap between industry and research. Every semester, we work with companies to experiment and apply these techniques in novel ways. ML@B members get the opportunity to use terabytes of data to create tools that do astonishing things, from predicting the prices of the stock market to exposing the underlying value of written text. Our focus on the future of computer science through ML affords us many opportunities that we use to drive research and education. We sponsor several research projects on the bleeding edge of ML over the semester and host a range of classes and workshops. ML@B members are chosen through a rigorous application process and are highly desired for their accomplishments and expertise. If you’d like to know more, feel free to email our club or check out our website.",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "http://ml.berkeley.edu/about",
    "has_about_page": true,
    "full_content": "A passionate student communityMachine Learning at Berkeley (ML@B) is a student-run organization based at the University of California, Berkeley dedicated to fostering a vibrant machine learning community on campus while contributing to the greater machine learning community beyond.Our MissionOur organization brings together undergraduate and graduate students with both a demonstrated aptitude and passion for the field of machine learning. We are a tight-knit community working on cutting-edge academic research, industry projects, and educational initiatives to make machine learning more accessible at all levels.Contact UsExternal The External committee brings opportunities in machine learning to the Berkeley community. This involves hosting a range of public-facing industry events — including the annual AI & EECS Career Fair (Fall) and Founders Meetup (Spring).For our members, External organizes hackathons, company visits, tech talks, our Alumni Dinner, and many more exciting events. We also engage industry and academic leaders in AI/ML to speak at our weekly general meetings.Learn MoreEducationThe Education committee helps shape the next generations of machine learners by running our New Member Education Program as well as our Decal. Being a part of the education team is a unique opportunity to learn from our close-knit community of instructors and organizers with years of experience, as well as to fast-track your involvement in \"the other side\" of upper education.Learn MoreResearchML@B's research committee works to improve exposure to emerging research through seminars, reading groups, and blog posts. They provide an environment for both ML@B members and the broader Berkeley student body to discover their research interests by learning, building, and sharing knowledge. They also support home-grown research projects at the frontier of ML, often advised by Berkeley faculty or industry scientists.Learn MoreProjectsProjects at ML@B is an innovative and dynamic platform that caters to a wide range of interests and professional aspirations among our members.Partnered with some of the biggest companies around the globe, ML@B's semester-long industry projects is an opportunity for members to explore their interests and gain experience applying their ML skills in the real world.Our CommunityWhile ML@B is great for professional opportunities and all, most of our members would say the best thing about the club is the tight-knit community. Our fifth and final committee—the Internal Committee—works to cultivate a supportive and fun environment that our members want to be a part of. This includes organizing our semesterly retreat, banquet, Big/Little Program, and other social events throughout the semester.",
    "status": "success"
  },
  {
    "name": "Neurotech@Berkeley",
    "website": "https://neurotech.berkeley.edu/",
    "eecs_summary": "contact@neurotech.berkeley.edu Neurotech@Berkeley serves as a hub for discussing the myriad technologies used in research and industry to collect, analyze, and utilize signals from the brain. As a student organization, we focus on non-invasive techniques such as EEG, TMS, and fMRI. Through meetings, workshops, and events, we aim to educate the wider community about the challenges and benefits of biosensing and neurotechnology. We further aim to be the central repository for biosensing hardware at UC Berkeley, providing access to devices for students to use for class, hackathons, or other projects.",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "https://neurotech.berkeley.edu/about.html",
    "has_about_page": true,
    "full_content": "About The brains behind Neurotech@Berkeley!",
    "status": "minimal_content"
  },
  {
    "name": "Queer Graduate Students in Computer Science and Electrical Engineering (QICSE)",
    "website": "http://qicse.cs.berkeley.edu/",
    "eecs_summary": "qicse@lists.eecs.berkeley.edu QICSE is the organization of queer graduate students in Computer Science and Electrical Engineering at the University of California at Berkeley. QICSE is a social group that supports gay, lesbian, bisexual, transgender, intersex, questioning, or queer grad students and their allies within the EECS department by offering them opportunities to connect to each other and with the broader campus community.",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "http://qicse.cs.berkeley.edu/",
    "has_about_page": false,
    "full_content": "",
    "status": "minimal_content"
  },
  {
    "name": "Robotics@Berkeley (R@B)",
    "website": "http://rab.berkeley.edu/",
    "eecs_summary": "leadership@rab.berkeley.edu The mission of Robotics at Berkeley is to create and maintain a financial, social, and informational hub for undergraduate roboticists at UC Berkeley by",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "http://rab.berkeley.edu/",
    "has_about_page": false,
    "full_content": "This website is unavailable. That could be due to maintenance, a technical glitch, or because it's been disabled. If you're the owner of this website and aren't sure why you're seeing this message, get in touch so we can help you out. This website is hosted by the Open Computing Facility, an all-volunteer student organization dedicated to free computing.",
    "status": "success"
  },
  {
    "name": "Women in Computer Science and Electrical Engineering (WICSE)",
    "website": "http://www-inst.eecs.berkeley.edu/%7Ewicse/",
    "eecs_summary": "wicse-presidents@lists.eecs.berkeley.edu WICSE is an organization that aims to support women graduate students in Computer Science and Engineering at the University of California in Berkeley. We meet every week for a casual lunch, and maintain several ongoing projects, including a mentorship program for new graduate students as well as larger social events and meetups within Berkeley and across universities.",
    "email": "aweberkeley@gmail.com",
    "scraped_url": "http://www-inst.eecs.berkeley.edu/%7Ewicse/#about-section",
    "has_about_page": true,
    "full_content": "Join Our Mailing List We would love for you to join our MAILING LIST! About Us Who We Are WiCSE was founded in 1977 by CS graduate students Paula Hawthorn, Diane McEntyre, Barbara Simons, Mary Ann Niemat, Susan Eggers, and Deborah Estrin and celebrated its 40th anniversary in March of 2018. This robust networking and advocacy organization has been successful in attracting and sustaining womxn students through sponsoring pre-college outreach and hosting activities from weekly lunches to national conferences. Sheila Humphreys, academic coordinator for student matters in EECS, credits WiCSE's success to its continuity, its ongoing contact with successful alumnae and other prominent women in the field, and to the support it receives from EECS for staff, space, and funding. Please enjoy Sheila's detailed histroy of WiCSE HERE. What We Do WiCSE aims at building a community between womxn graduate students and creating a welcoming and supportive environment for them throughout their graduate studies. Cultivating important ties with industry partners and research institutions, WiCSE is highly involved in outreach programs designed to develop interest in science among young womxn throughout their childhood and teenage years. We organize workshops to help our members develop professional skills, and host networking events with industry partners, researchers, and professors. WiCSE builds and maintains a strong professional network to provide advice and opportunities to its members. Calendar To add the WiCSE calendar to your Google Calendars, click the + button at the lower right-hand corner Meet the Officers Co-Presidents: Jessica Dai, Paula Gradu, Deb Raji (remote Fall 2023) Secretary: Sabriya Alam Lunch Coordinator (Soda/Cory): Sophie Koh Outreach Coordinator: Marwa Abdulhai Industry Liaison: Could be you! Treasurer: Could be you! Lunch Coordinator (Berkeley Way West): Could be you! Sponsors Interested in sponsoring WiCSE? See our options below. Please contact Marwa Abdulhai (marwa_abdulhai [at] berkeley.edu) with any questions! Bronze Silver Gold $1000 $2000 + Cost of Event $3000 + Lunch Provide a donation to WiCSE Sponsor a social event with your representatives Get a one-on-one at our virtual WiCSE luncheons! We will: Prominently display your company name on our website. We will: Help create event ideas Advertise your event Prominently display your logo on our website in a medium size We will: Distribute promotional materials to our members Prominently display your logo on our website in a large size Thank you to our Sponsors and Supporters! Current Sponsors Past Sponsors & Other Supporters We appreciate generous past sponsorship from: Cruise, Activision Blizzard, Berkeley EECS, General Motors, NVIDIA, Berkeley Engineering, CITRIS and the Banatao Institute, Google, Uber, Cisco, EECS, UC Berkeley Graduate Assembly, Intel, Lockheed Martin, Morgan Stanley, Jane Street, DE Shaw, Pinterest, Splunk Also thank you to all those not mentioned here who have contributed over the years in many ways. Current and past WiCSE members have contributed their participation and enthusiasm and kept WiCSE an active club for many years. In addition Sheila Humphreys has been an invaluable supporter and organizer. Copyright © Optics. Designed by TemplateWire WICSE",
    "status": "success"
  },
  {
    "name": "Black Graduate Engineering and Science Students (BGESS)",
    "website": "https://callink.berkeley.edu/organization/gablackgraduateengineeringandscience",
    "eecs_summary": "bgess.berkeley@gmail.com BGESS is dedicated to the nurturing of academic and social support systems for historically underrepresented students in the United States at UC Berkeley. Black Graduate Engineering and Science Students (BGESS) has been established for 31 years with a fourfold mission: recruitment, retention, and professional development of Black graduate students in STEM fields at Berkeley, along with outreach to the local community. Their events and activities focus on delivering on that mission.",
    "email": "ieee@berkeley.edu",
    "scraped_url": "https://callink.berkeley.edu/organization/gablackgraduateengineeringandscience",
    "has_about_page": false,
    "full_content": "Black Graduate Engineering and Science Students 💙AboutThe Black Graduate Engineering and Science Students Society is an academic and social support network that targets black graduate students and allies of black students within the University of California at Berkeley’s STEM disciplines. Through our programming, we help ensure that black graduate students can successfully contribute to both scientific research and the college’s learning environment. Contact Information Address 312 Eshleman Hall Berkeley, CA 94704 United States Contact Email E: bgess@berkeley.edu Phone Number P: 6786623933 Additional Information INFORMATION ABOUT HOW TO GET INVOLVED WITH THIS ORGANIZATION IS FOUND HERE https://callink.berkeley.edu/organization/gablackgraduateengineeringandscienceFind information below about the OASIS Center organization category and who the administration contact is (see https://lead.berkeley.edu/meet-our-staff/):Callink DesignationOASIS Category: Graduate Student RSOUndergraduate/Graduate Student CompositionGraduate StudentsPrimary Campus AdvisorB.B. Bradley (Black/AfAm RSOs) at bradleyb@berkeley.eduAdditional Advisor, if applicable. Some groups benefit from having assigned advisors across units. This relationship can be informal or formal. If formal, the advisor name appears here:Grad RSO OASIS Advisor at gradstudentorgadvisor@berkeley.eduContactPublic EventsThere are currently no upcoming events. View past events.View More EventsSign In To View OfficersDocumentsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsView All Documents",
    "status": "success"
  },
  {
    "name": "Electrical Engineering Graduate Student Association (EEGSA)",
    "website": "http://www.eecs.berkeley.edu/%7Eeegsa",
    "eecs_summary": "The Electrical Engineering Graduate Student Association is a service and social organization within the EECS department at UC Berkeley. They organize prelim review sessions, provide peer advising services, and assist with new student orientation. In an effort to promote communication and camaraderie within the department, they sponsor social activities such as the weekly coffee hours. EEGSA also sponsors occasional ice cream socials, wine and cheese parties, and dances.",
    "email": "ieee@berkeley.edu",
    "scraped_url": "http://www.eecs.berkeley.edu/%7Eeegsa",
    "has_about_page": false,
    "full_content": "Cookies Disabled Your browser does not support cookies. The browser's ability to store or read cookies is essential for single sign-on to work. Please consult your browser settings and ensure cookie support is turned on. CalNet Authentication Service CalNet ID: CalNet ID is a required field. Passphrase: Passphrase is a required field. Sign In Show HELP below Hide HELP Sponsored Guest Sign In Forgot CalNet ID or Passphrase? Manage my CalNet account Help Contact Help desk information Manage my CalNet account How to Sign In as a SPA To sign in to a Special Purpose Account (SPA) via a list, add a \"+\" to your CalNet ID (e.g., \"+mycalnetid\"), then enter your passphrase. The next screen will show a drop-down list of all the SPAs you have permission to access. Select the SPA you wish to sign in as. To sign in directly as a SPA, enter the SPA name, \"+\", and your CalNet ID into the CalNet ID field (e.g., “spa-mydept+mycalnetid”), then enter your passphrase. To view and manage your SPAs, log into the Special Purpose Accounts application with your personal credentials. Copyright © 2025 UC Regents. All rights reserved.",
    "status": "success"
  },
  {
    "name": "Formula Electric at Berkeley (EV)",
    "website": "http://ev.berkeley.edu/",
    "eecs_summary": "Formerly Berkeley Hyperloop contact@ev.berkeley.edu Formula Electric at Berkeley is a team of undergraduate and graduate students that designs, builds, and races a formula-style electric race car in the Formula SAE EV competition. We aim to push the boundaries of sustainable transportation technology while equipping teammates with valuable engineering and entrepreneurial skills.",
    "email": "ieee@berkeley.edu",
    "scraped_url": "http://ev.berkeley.edu/",
    "has_about_page": false,
    "full_content": "DESIGN. INNOVATE. LEARN. We build EV racecars from the ground up.MechanicalWe engineer the car’s mechanical systems prioritizing safety while balancing weight and performanceBusiness and OperationsThe business team handles finances along with securing sponsorships, marketing, and on campus events.Electrical Engineering & Computer ScienceEngineering the intelligence behind our race car—high-voltage power, low-voltage control, and everything in between.Education Through Hands-On LearningAt Formula Electric, everyone plays an integral role in building the car. Our members design custom circuit boards, machine high precision parts, develop autonomous driving systems and more. We develop skills that translate beyond the competition.WeldingManufacturingSimulationsComputer Aided DesignAutonomousEECSWeldingManufacturingSimulationsComputer Aided DesignAutonomousEECSWeldingManufacturingSimulationsComputer Aided DesignAutonomousEECSYoung but BOLD.Founded during the COVID-19 pandemic, we are one of the younger teams on the grid—but our engineering speaks for itself. We embrace cutting-edge innovation, designing and building a car that rivals even the most established competitors. Here are some highlights from our latest build.Top-Level SimulationCustom Aluminum Wheel HubsRedesigned Accumulator Optimized DesignCompanies Love Formula ElectricThank you to our sponsors for making this happen. We couldn't have done it without you. Frequently Asked QuestionsHow can I join?When is the competition?How big of a commitment is FEB?Do I need prior experience to join?",
    "status": "success"
  },
  {
    "name": "Institute of Electrical and Electronics Engineers (IEEE Student Branch)",
    "website": "https://www.facebook.com/ieeeucb/",
    "eecs_summary": "Formerly UCSEE ieee@berkeley.edu We are the student chapter of IEEE at U.C. Berkeley. As an active organization on campus, we provide lab services, promote student professional awareness, participate in outreach programs, and serve as the backbone for student-industry networking in EECS. In addition to hosting industry events such as infosessions and the semi-annual Startup Fair, we plan social activities to maintain balance with the technical atmosphere.",
    "email": "ieee@berkeley.edu",
    "scraped_url": "https://www.facebook.com/ieeeucb/about",
    "has_about_page": true,
    "full_content": "UC Berkeley IEEE 2.2K followers • 8 followingPostsAboutPhotosMorePostsAboutPhotosUC Berkeley IEEEAboutContact and basic infoPage transparencyDetails About UC Berkeley IEEECategoriesCollege & universityContact info288 Cory Hall, Berkeley, CA, United States, 94720Addressieee@berkeley.eduEmailWebsites and social linkshttps://ieee.berkeley.edu/WebsitePhotosUC Berkeley IEEE's PhotosTagged photosAlbumsMoreUC Berkeley IEEE's PhotosTagged photosAlbumsSee all",
    "status": "success"
  },
  {
    "name": "Society of Women Engineers (SWE)",
    "website": "https://swe.berkeley.edu/",
    "eecs_summary": "swe.berkeley@gmail.com Society of Women Engineers is a national nonprofit organization. SIts objective is to encourage and empower women to reach their full potential as engineers. SWE strives to highlight the achievements and contributions of women as leaders and engineers. Supporting both students and professionals, SWE consists of over 17,000 members in 90 sections and 300 student sections. The UC Berkeley student chapter has been established since 1975 and supports students through professional development, social events and outreach to young women interested in the STEM field.",
    "email": "ieee@berkeley.edu",
    "scraped_url": "https://swe.berkeley.edu/about.html",
    "has_about_page": true,
    "full_content": "Our SWE Section Mission The UC Berkeley SWE section strives to support the next generation of women and non-binary engineers by: providing professional development resources and networking opportunities to help students navigate the start of their careers; hosting socials to connect engineers with others in their area of study; organizing STEM advocacy and inclusion workshops, encouraging both women and non-binary engineers and allies to fight for an equitable workplace; and leading outreach programs for local K-12 students — geared especially towards underrepresented youth — to help them learn more about STEM. Awards Gold FY10: Strategic Communications Print Newsletter FY16: Outstanding Collegiate Section FY17: Outstanding Collegiate Section FY18: Outstanding Collegiate Section FY19: Outstanding Collegiate Section FY20: Outstanding Collegiate Section FY21: Outstanding Collegiate Section FY22: Outstanding Collegiate Section FY23: Outstanding Collegiate Section FY24: Outstanding Collegiate Section Silver FY10: Outstanding Collegiate Section FY13: Outstanding Collegiate Section Other FY19: 1st Place Team Tech Competition FY19: SWE Advocacy FY20: Best Practice: Multicultural FY20: Best Practice: Partnerships with Collegiates, Professionals, Industry and Academia FY21: Best Practice: Multicultural Land Acknowledgement UC Berkeley SWE acknowledges that UC Berkeley sits on the territory of xučyun (Huichin), the ancestral and unceded land of the Chochenyo speaking Ohlone people, the successors of the sovereign Verona Band of Alameda County. We recognize that every member of the Berkeley community has, and continues to benefit from, the use and occupation of this land, since the institution's founding in 1868. Consistent with our values of community, inclusion, and diversity, we have a responsibility to acknowledge and make visible the university's relationship to Native peoples. As members of the Berkeley community, it is vitally important that we not only recognize the history of the land on which we stand but also, we recognize that the Muwekma Ohlone people are alive and flourishing members of the Berkeley and broader Bay Area communities today. FAQ What opportunities does SWE provide for UC Berkeley students? SWE organizes many different events for students throughout the semester. We hold infosessions and career workshops with our sponsors, giving students the unique opportunity to network with industry leaders and professionals. There are also volunteer opportunities through our various outreach programs. Furthermore, we have socials and hangouts for members to come and have fun together. We also can't forget about our advocacy, equity, and inclusion focused workshops! To stay up to date with all the latest events, sign up for our weekly SWEmails! What opportunities does SWE provide for elementary, middle school, and high school students? SWE has many different outreach programs for all elementary, middle school, high school, and prospective students. To learn more about them visit our outreach page. Who can join? SWE is open to all UC Berkeley students who are interested! Our members come from a diverse background of engineers and other STEM-related fields. Regardless of major, gender, and identities, SWE is an inclusive space for anyone who is passionate about Gender Equality in STEM. How can I get involved in SWE? The best way to get involved is to become a committee member and/or apprentice. Our committee applications open at our first General Meeting of the semester. Our officer applications open towards the end of every semester. To learn more about each position visit our get involved page. Our company is interested in partnering with SWE. Where do we start? We're excited to have you join us! You can view our corporate package and learn more at our corporate page. More questions? You can email us at swe.berkeley@gmail.com for any of your inquiries. We try to respond as soon as possible.",
    "status": "success"
  },
  {
    "name": "ANova",
    "website": "https://www.berkeleyanova.org/",
    "eecs_summary": "executive@berkeleyanova.org ANova is a student organization dedicated to improving computer science education in under-resourced communities across the Bay Area. We partner with middle and high school teachers and administrators to develop curriculum catered individually for each classroom. Our outreach and mentorship efforts strive to introduce students of all backgrounds to computer science.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "https://www.berkeleyanova.org/about",
    "has_about_page": true,
    "full_content": "Our MissionEducate ✱ Empower ✱ Engage Mission StatementWe aim to make computer science education and opportunities within computer science more equitable, available, and achievable for students of all backgrounds.ANova is a student organization that seeks to empower students by providing computer science education and mentorship to under-resourced schools and marginalized communities. Our mentors develop individualized curriculum to teach at each of our middle and high school sites, with the goal of increasing equitable exposure and accessibility to the tech space. Our ServicesOur members go on weekly visits to our partnered schools to teach a project-based afterschool computer science program. Additionally, ANova offers events such as ANova Day to support high school students — our resources include college-essay reviews, campus tours, major showcase student panels, and technical workshops. Every year, the club hosts ANova Hacks: a 24-hour hackathon for high school students with little to no programming experience. Over the course of the day, students work in teams to design and code an innovative idea aiming to solve real-world problems. Fall 2024 Our MembersANova is driven by a tight-knit community of UC Berkeley students, who are passionate about educational outreach and computer science mentorship. As part of our committees, members work on various projects such as curriculum building, graphic design, web development, and event planning.",
    "status": "success"
  },
  {
    "name": "BERKE1337 Computer Security Team",
    "website": "http://berke1337.org/",
    "eecs_summary": "berke1337-admin@lists.berkeley.edu The BERKE1337 Computer Security Team is a group of computer security enthusiasts at UC Berkeley. Our mission is to organize, hack, defend, and educate our members in the field of security with particular emphasis on understanding emerging technologies and developing practical security skills. We compete in many cyber security competitions such as CTFs and CCDC in order to fortify and practice our security knowledge in a safe and ethical way.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "http://berke1337.org/",
    "has_about_page": false,
    "full_content": "Our new self-hosted site is online and available at https://1337.berkeley.edu! Join us for our general meetings this semester on Mondays 7:00-8:00 PM at Sutardja Dai Hall 621. We typically provide snacks and challenges to work on, so bring a laptop and a friend! Come chat with us on Discord to stay up to date on meetings and social events! Meeting Slides: SP 25 FA 24 FA 23 FA 22 SP 22.",
    "status": "success"
  },
  {
    "name": "Cal Blueprint",
    "website": "https://calblueprint.org",
    "eecs_summary": "Contact Cal Blueprint Blueprint is a club at UC Berkeley that develops pro-bono apps for nonprofits and promotes tech for social good. Our mission is to make beautiful engineering accessible and useful for those who create communities and promote public welfare. We place the interests of the people and partners we serve above our own; value the academic, social, and personal growth of our peers; seek to cherish our time spent together; recognize that change is both inevitable and necessary; ande strive to remain humble, accept our imperfections, and be receptive to feedback.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "https://calblueprint.org/about",
    "has_about_page": true,
    "full_content": "About The ClubWe’re a club at UC Berkeley that develops pro-bono apps for nonprofits and promotes tech for social good.Read MoreMissionValuesThe TeamOur Mission StatementTo make beautiful engineering accessible and useful for those who create communities and promote public welfare.Our Values01Mission FirstWe as Blueprint members ultimately unify under one goal - achieving our mission. We place the interests of the people and partners we serve above our own. Our primary measure of success is the amount of positive impact we create through our work.02Perpetual GrowthWe as Blueprint members value the academic, social, and personal growth of our peers. We constantly seek to perpetuate the cycle of learning and teaching, for our benefit and for others. We strive to offer a helping hand in times of need and push each other to succeed.03Cherish Each OtherWe as Blueprint members seek to cherish our time spent together. We develop meaningful relationships that extend well beyond the scope of the organization. We value each other as individuals and appreciate our differences.04Always InnovateWe as Blueprint members recognize that change is both inevitable and necessary. We are committed to innovate and emphasize effective solutions as needed in order to remain relevant - nothing is sacred. We welcome new ideas and diverse thinking.05Be HumbleWe as Blueprint members strive to remain humble, accept our imperfections, and be receptive to feedback. We approach challenges with an open mind and remember that anyone can pursue social good, not just Blueprint.The TeamSarah PengPresidentRohin JunejaVP of OperationsAnn JamesVP of ExternalKyrene TamVP of DesignCharlotte LawInternal VPCatherine TanVP of ProjectsKyle RamachandranVP of TechnologyAiden MathewProject LeaderEthan TamProject LeaderMelissa LiuProject LeaderNeha HussainProject LeaderRachael ChenProject LeaderAustin WuDesignerKevin YamashitaDesignerMadison LeeDesignerNishat KaziDesignerYash SaswadeDesignerAnh VoExternal DirectorAvani KulshreshthaExternal DirectorJoshua HuangExternal DirectorJustin KeyoExternal DirectorAlex WangProject DeveloperBhavita PeddiProject DeveloperCarolyn ZhuangProject DeveloperCody GarciaProject DeveloperDion ChiaProject DeveloperDylan TohProject DeveloperEmily PengProject DeveloperEsha BansiyaProject DeveloperEthan GuProject DeveloperInaya YusufProject DeveloperJeannine RuizProject DeveloperJinkang FangProject DeveloperJustin LeeProject DeveloperKevin SolorioProject DeveloperMonique Mabasa ChengProject DeveloperNataliia KulieshovaProject DeveloperNathan TamProject DeveloperPhilip YeProject DeveloperSai TunguturuProject DeveloperSamuel HudsonProject DeveloperStephen HungProject DeveloperTorin NayakProject DeveloperAditya PawarSocialAida AbaySocialArfa MominSocialBrian WenSocialCarys AtmodjoSocialCeline ChoiSocialCreighton TuckerSocialDeena SunSocialJoshua ChouSocialJustin XueSocialNathan HuynhSocialPiper YuSocialRonnie BeggsSocialSarah MouSocialSashank BalusuSocialAlumniAllison HongProject DeveloperAngeline TuProject DeveloperChristopher TorresProject DeveloperClaire WangSenior AdvisorIris MyungVP of ExternalKaleen ChenProject DeveloperKaty NguyenInternal VPPragya KallanagoudarSenior AdvisorAlvaro OrtizSocialAndrei TanSocialBuyankhuu TsolmonkhuuSocialDanielle WongSocialEthan AuyeungSocialMarcos HernandezSocialMia ChouSocialSauhard JainSocialDavid QingPresidentMiha BhaskaranVP of OperationsAndrew WangPresidentNoah HernandezVP of TechnologyEsther LeeVP of DesignBrenda VuongDesignerStephanie WongProject DeveloperEmily SunaryoProject DeveloperRahi HazraProject DeveloperFolasade OloyeProject DeveloperKevin CaiProject DeveloperKabir GoelVP of ProjectsSelene HuangProject DeveloperTiffany WangVP of TechnologySuraj RaoVP of TechnologyAnnie HuoInternal VPDanashi MesseleInternal VPAkshay ThakurProject LeaderCasey LeiProject DeveloperKelly HuPresidentSteven HuangVP of OperationsCharles MingVP of OperationsJacob KimVP of TechnologyShannon BonetPresidentAnnie WangVP of TechnologyJared KeatingInternal VPEvan QuanVP of DesignGregoria MillensiferProject LeaderAnu ThirunarayananExternal DirectorJay KudvaExternal DirectorAlbert LiuProject LeaderSami OhProject DeveloperKenneth MartinezProject DeveloperKenny ChiProject LeaderSofia Howard-JimenezProject LeaderCecilia GaoDesignerElizabeth WuPresidentJenny JiangInternal VPFranco MonterrosaExternal DirectorJames GersbachProject DeveloperSonja JohansonPresidentNick WongExternal VPCindy ZhangInternal VPDivi SchmidtVP of ProjectsAce ChenPresidentGrace NgDesignerAndi HalimProject ManagerBryanna GavinoTechnical LeadSydney BuiProject ManagerWilliam HuangProject DeveloperSandra ZavalaProject DeveloperNerissa HsiehDesignerMicah YongVP of TechnologyYulin LiProject DeveloperManaal SiddiquiProject DeveloperEileen LiuExternal DirectorTanya KrishanExternal DirectorKarina NguyenExternal VPGabe TiuTechnical LeadJen HoangVP of ProjectsMyles DomingoVP of DesignFrederick KimPresidentKenneth LienProject ManagerCalvin ChenExternal DirectorStefania GhercaProject DeveloperPhoebe LiTechnical LeadJoyce GuoProject DeveloperAlly NovalesExternal VPSusan LinProject LeaderEthan LeePresidentErin SongVP of ProjectsRachel HeExternal VPJinsu ElhanceProject DeveloperJoelene LatiefVP of DesignKyle HuaProject DeveloperChristopher GreyProject DeveloperAlison DowskiPresidentSpring MaExternal VPKevin LiVP of TechnologyFang Shuo DengProject ManagerGibson ChuExternal VPShannon HongProject DeveloperAshley KimDesignerIvee ZhouExternal DirectorLucy SongExternal DirectorJulian KungProject LeaderJoy DongProject DeveloperAlice ZhaoProject LeaderAivant GoyalPresidentCassandra MelaxProject DeveloperClaire LinProject LeaderEmma StephanProject DeveloperTanthai PongstienContent DirectorMaria TerrenalProject DeveloperAnnie RoProject LeaderAnnie ZhengDesignerArpan PalInternal VPAshley NguyenProject DeveloperAsli AkalinProject DeveloperAudrey KuPresidentAvery YipProject LeaderCathleen JiaProject DeveloperEmily ZhongVP of DesignIris HouDesignerJohnathan ZhouProject DeveloperJustin MiProject LeaderNoah AlcusInternal VPPeter VeermanVP of ProjectsSuhas RaoProject DeveloperThu NguyenProject DeveloperTommy PoaProject DeveloperWilson WangProject LeaderMelody WeiProject LeaderPooja NagpalVP of ProjectsLois ChangPresidentCalvin DongVP of ProjectsGrant KalaskyExternal VPBarbara YangProject LeaderSteve ShiProject LeaderTony YangProject LeaderAmy ShanProject DeveloperJason BaoProject DeveloperFlorence LauProject DeveloperMukil LoganathanProject DeveloperKevin DeguzmanProject DeveloperJemma KwakDesign DirectorVanessa NgDesign DirectorTao OngExternal VPKen ChenPresidentNeel SomaniExternal AdvisorMichelle KwonProject LeaderMichael DoProject LeaderVivian YaoDirector of ExpansionJimmy LiuOperations DirectorNhi QuachProject DeveloperHelen CheProject DeveloperGreta HuangProject DeveloperEric LiangProject DeveloperCasey TakahashiProject DeveloperSteven ZhengMentorJonathan ChuPresidentAlice DengExternal VPSonia YangInternal VPJason XieVP of ProjectsAndrew MillmanVP of ProjectsNikita RauProject LeaderKelsey LamProject DeveloperPamela HuDesign DirectorJason WangOperations DirectorIsaiah YoonHistorianKenneth SteeleProject DeveloperMicah CarrollProject DeveloperAllan WuProject DeveloperDaniel LiPresidentShreya ShanbhagExternal VPCharles XueProject LeaderWarren ShenProject LeaderKevin WuPresidentVivek RaghuramDirector of ExpansionSoo SongMentorSam LauMentorEric ChangProject LeaderGrace NohProject DeveloperJeff GongProject DeveloperYing LuoProject DeveloperGarrett TanProject DeveloperNishant DesaiMentorSameera VemulapalliProject DeveloperAleks KamkoMentorDerrick MarProject DeveloperHoward ChenPresidentQuinton DangInternal VPAnthony HuangProject DeveloperShannon ChuProject DeveloperAndy QinProject DeveloperUnzi ParkProject DeveloperEric ShenProject DeveloperMax WolffeProject DeveloperEthan ChiouProject DeveloperErica YinProject DeveloperTricia FuProject DeveloperQuinn RomanekProject DeveloperJordeen ChangVP of ProjectsNikhil NarayenVP of TechnologyJoey PereiraProject LeaderJessica LinPresidentAlice OhExternal VPMark MiyashitaVP of TechnologyJessica ShenCorporate Relations DirectorByron ZhangProject LeaderVarun RauProject LeaderAtsunori KakitaniProject LeaderElizabeth LinProject DeveloperJason WonProject LeaderNoah GilmoreProject LeaderHarrison TsaiProject DeveloperKevin ShiehProject DeveloperWill TangProject DeveloperAnthony SutardjaProject DeveloperMelissa HuangPresidentDeepak WarrierProject DeveloperJohn DuProject DeveloperBrian LiouProject DeveloperAlton ZhengProject DeveloperAlli LeongProject LeaderWonjun JeongPresidentMichelle ChowVP of TechnologyTony WuVP of ProjectsChen-Chen HuoSponsorKevin GongPresident / FounderJae RyooPresident / FounderblueprintGeneralAboutTeamProjectsContactBlogStudentsApplyProcessFAQsNonprofitsApplyProcessFAQsSocial MediaFacebookTwitterInstagramGithubBlog© Blueprint 2025",
    "status": "success"
  },
  {
    "name": "CodeBase",
    "website": "http://codebase.berkeley.edu",
    "eecs_summary": "contact@codebase.berkeley.edu CodeBase is one of Berkeley’s first technical consulting groups, spearheading technical challenges for high-growth startups. CodeBase helps companies bridge technical gaps by developing mobile and web applications, assisting companies in setting up scalable infrastructure, providing code review/application testing, and implementing future product features for research and evaluation.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "http://codebase.berkeley.edu/about/",
    "has_about_page": true,
    "full_content": "OUR MISSIONWe are a community of developers that empowers students to break into the software industry.Read more on our blog →OUR BASE BEHAVIORSPut People FirstWe care about the community we’re all part of and value treating our peers with respect and trust.01Put People First02Actively Take Ownership03Seek Continuous Growth04Communicate Candidly05Genuinely Give BackThe TeamMeet our members who make Codebase the community it is today!Cindy SanchezPresidentAllison DanaVP of ExternalAngie ZhuVP of OperationsAnika SikkaVP of EducationJaanavi ThanamalaVP of ExternalKinton DuongVP of ProjectsNicole MartinezVP of ProjectsPatrick MendozaVP of EducationRachel HuVP of InternalAshwarye YadavProject ManagerCamila Quezadas Project ManagerEduardo LopezProject ManagerJessica HeProject ManagerRenata Martinez CamargoProject ManagerSamion SuwitoProject ManagerSarika PasumarthyProject ManagerSocrates OsorioProject ManagerAdam HackerDeveloperAdelina ChauSocialAlbert GonzalesDeveloperAndrew TabbertSocialAnnabella NguyenDeveloperArjun MathuDeveloperAzariah SmithDeveloperBen PhamDeveloperChristy HuangSocialCrystal ChenSocialDaniel WangSocialDeven MittalDeveloperEthelyn HuangDeveloperEvelyn SalazarDeveloperFredericDeveloperFrida ArriagaDeveloperHabeeb TiamiyuDeveloperIsael LariosDeveloperJaansi ParsaProject AdvisorKatia Jacoby DeveloperKenneth LlontopDeveloperKourosh SalahiDeveloperLaura GuoDeveloperMadison JacksonDeveloperManya SinvhalDeveloperMenim Utibe-UkimDeveloperMichael LiuSocialMichael NgSocialNishant MalpaniSocialNitya BhartiyaDeveloperParth ChhabraDeveloperSaadhvi NarayananSocialSangJun LeeDeveloperSashank BalusuSocialShweta SurendarDeveloperSophia Carazo-OrtizDeveloperTanya BhakhriSocialTaran BrownDeveloperTayler NguyenDeveloperValerie EngDeveloperYamuna RaoSocialClub StructureThroughout their time in Codebase, our members take on a variety of positions. Our structure is relatively flat so that everybody has an active role in shaping our club.Vice President“I wanted to become a VP to give back to a community that’s special to me. I get to pursue initiatives I’m passionate about to help Codebase grow into an even stronger community. Seeing our members enjoy club socials and grow into their best selves professionally, all while knowing that my work created a space for them to thrive. That’s truly fulfilling.”Client Project Manager“As a Client PM, you’re at the heart of the club– guiding devs through the project and shaping their team experience. For me, that meant anything from late-night food runs up Firetrails to days spent debugging, all to make sure my devs had an amazing and fulfilling time. The memories, the friends, and their growth as developers made it all unforgettable.”Client Developer“As a client developer, I learned something new at every step of the project, and really gained invaluable industry experience in doing so. Each project was uniquely valuable in its own way, and on every project, the highlight was always the team. I've grown so close to these people; they made every worksession so, genuinely fun!”Mentored Project Manager“I became a mentored PM because I wanted to support my developers as they take their first steps into tech. Through our full-stack curriculum and by building a website for an NPO, they’ve gained so much confidence—and it’s been incredible to watch them grow in such a short time.”Mentored Developer“Being a mentored developer was an experience like no else; I learned so much about full stack web development– something I'd never touched just a few months ago. Our PMs put so much dedication so much time and effort into us. On mentored, I met some of the closest friends I have at Cal!”Beyond CodebaseOur members and alumni have continued their success through internships and full-time employment across a variety of industries.Meet Our Alumni →Our AlumniAlways a part of the Codebase community.Ani Pai, 2026Client DevClient PMKenny Chen, 2026Mentored DevClient DevClient PMIVPAdvisorBrandon Wu, 2025Mentored DevClient DevClient PMMentored PMDominic Charles, 2025Mentored DevClient DevClient PMDylan Nguyen, 2025Client DevEugene Han, 2025Client DevGargi Deshpande, 2025Client DevMentored DevVPPJc Sun, 2025Mentored PMClient PMClient DevJoel Cisneros, 2025Client DevIVPJustin Hong, 2025Mentored DevClient DevMentored PMClient PMLizbeth Torres Madrigal, 2025Client DevClient PMVPPMaría Fernanda Romano Silva , 2025Client DevClient PMVPPPresidentRitik Sinha, 2025Client DevClient PMPresidentWilliam Zeng, 2025Client DevClient PMOpsVPPAnthony Lu, 2024Mentored DevClient DevClient PMVPPMentored PMKieron Ong, 2024Mentored DevClient DevClient PMEVPOpsAdvisorRithu Paramesh, 2024VPPClient PMClient DevSurbhi Jain, 2024Client DevClient PMEVPPresidentAdvisorConnie Shi, 2023Client DevClient PMVPPConnor Lien, 2023Client DevClient PMVPPEmily Su, 2023Client DevClient PMEVPVPPKalea Chu, 2023Mentored DevClient DevVPPOpsLaryn Qi, 2023Mentored PMClient PMClient DevRyan Zhao, 2023Mentored PMClient DevClient PMPresidentSahil Thakur, 2023Mentored DevClient DevClient PMStephanie Xiao, 2023Mentored DevClient DevClient PMEVPZaid Mamsa, 2023Mentored DevClient DevClient PMIVPVPPFrancesca Song, 2022Mentored DevClient PMClient DevVPPKathleen Kong, 2022Mentored DevClient DevIVPEVPWilliam Zhou, 2021Mentored DevClient DevClient PMIVPEVPAbhishyant Khare, 2019PresidentAdvisorParth Shah, 2019Mentored PMClient DevPresident",
    "status": "success"
  },
  {
    "name": "Code the Change, Berkeley chapter",
    "website": "https://callink.berkeley.edu/organization/codethechange",
    "eecs_summary": "berkeley@codethechange.org Code the Change is an organization that empowers computer scientists to use their technical skills for social good through non-profit projects. The Berkeley chapter consists of two divisions. Our DeCal program is intended for students with less experience in computer science; it offers them a chance to learn web development while working on a project for a nonprofit organization. Our other division is comprised of project teams, which work on more challenging projects for nonprofits.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "https://callink.berkeley.edu/organization/codethechange",
    "has_about_page": false,
    "full_content": "Code the Change About Additional Information INFORMATION ABOUT HOW TO GET INVOLVED WITH THIS ORGANIZATION IS FOUND HERE To be completed by student leader during registrationFind information below about the OASIS Center organization category and who the administration contact is (see https://lead.berkeley.edu/meet-our-staff/):Callink DesignationOASIS Category: Service RSOUndergraduate/Graduate Student CompositionUndergraduate Students Primary Campus AdvisorEmily Enriquez at emilyenriquez@berkeley.eduAdditional Advisor, if applicable. Some groups benefit from having assigned advisors across units. This relationship can be informal or formal. If formal, the advisor name appears here:Not ApplicableContactPublic EventsThere are currently no upcoming events. View past events.View More EventsSign In To View OfficersDocumentsConstitutionAmendment 8/17/14Constitution/BylawsCode The Change Constitution.docxCode the Change Amendment.pdfCode the Change v.1.pdfCode the Change v.2.pdfCode the Change at Berkeley- Constitutional Amendment Proposal 1.pdfCode the Change at Berkeley.pdf",
    "status": "success"
  },
  {
    "name": "Cognitive Science Students Association (CSSA)",
    "website": "https://cssa.berkeley.edu/",
    "eecs_summary": "cssa@ocf.berkeley.edu CSSA is an undergraduate organization at UC Berkeley whose mission is to support and enrich the academic life of anyone interested in the interdisciplinary study of the brain and mind. Cognitivie science involves fields such as neuroscience, psychology, philosophy, linguistics, computer science, social cognition, and others, to try to shed light on how the mind works. We regularly coordinate academic events such as guest lectures and information sessions; plan social events like professor-student dinners and cog sci themed gatherings; and work with cog sci faculty and university officials to provide assistance for students. Additionally, the CSSA teaches its own decal on research methodology, has an academic outreach program, and organizes the annual California Cognitive Science Conference",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "https://cssa.berkeley.edu/about.html",
    "has_about_page": true,
    "full_content": "ABOUT US What is CSSA? The CSSA is an undergraduate organization at UC Berkeley, aiming to support and enrich the academic life of anyone interested in the interdisciplinary field of Cognitive Science. We strive to build a sense of community for those passionate about cognitive science and provide them with valuable opportunities for personal, academic, and career development. What do we do? We regularly coordinate academic events such as guest lectures and information sessions; plan social events like student-teacher dinners and cog sci themed gatherings; work with cog sci faculty and students to provide assistance for students. Additionally, CSSA has an academic outreach program, and organizes the annual CSSA Conference. What is Cognitive Science? Cognitive science is the interdisciplinary study of the brain and mind. It uses fields such as neuroscience, psychology, philosophy, linguistics, computer science, social cognition, and others to try to shed light on how the mind works. At UC Berkeley, it entails taking classes in the six disciplines listed below and integrating this knowledge for a more holistic approach towards solving fundamental problems pertaining to the nature of mind. Solving such problems relies on aspects of all these disciplines, making cognitive science an essential framework for discovering these solutions. The program at UC Berkeley also allows students to take electives in any of these disciplines, letting them focus their studies on a specific aspect(s) within cognitive science if they choose to. The Berkeley campus also has numerous labs and research opportunities so students can explore their interests further and get involved in the research process. Psychology ⌵ Neuroscience ⌵ Philosophy ⌵ Linguistics ⌵ Computer Science ⌵ Society/Environment ⌵ Cognitive Psychology Cognitive Psychology focuses on cognitive functions of the brain. These functions include perception, memory, and attention. These courses are usually offered by the Psychology department, and so may have restricted enrollment, especially in Phase 1. Courses you can ask us about: PSYCH 126, 140, 150, COGSCI 100, 190 Cognitive Neuroscience Cognitive Neuroscience involves studying the structure of the brain, as well as the overlaying functions. The courses you will take will be biology-heavy (think MCB61/64). The upper division courses may require self studying a lot of material that is covered in the lower division courses for MCB, IB, or MicroBio majors. Courses you can ask us about: PSYCH 117, 127, 133, MCB 161 Philosophy The philosophy distribution tackles the big questions in Cognitive Science: questions about what thought and intelligence mean. Philosophy classes are some of the hardest to get into, especially because no classes are crosslisted with Cognitive Science. Some lower division courses are being offered in place of upper divisions that still fulfill the requirement. Courses you can ask us about: PHILOS 3, 132, 133, COGSCI 180 Linguistics Cognitive Linguistics studies mental processes and thought through language. The Linguistics courses range from pure linguistics (such as Ling 100), to concepts that introduce cognitive perspectives to language (i.e. Ling 105). Look into individual courses or ask someone to see what Linguistics courses strike your fancy! Courses you can ask us about: LINGUIS 100 Computational Modeling Computational modeling tries to answer questions of cognition and brain function through engineering and algorithmic approaches found in Computer Science. Courses offered by the Computer Science department have very restricted enrollment for non-majors. If you are not a CS major, you can only be added onto the waitlist for upper-division CS classes during Phase 2. Declared, non-senior majors can add courses in Phase 2. Phase 1 is reserved for senior majors only. Courses you can ask us about: COGSCI 131, CS 188 Society, Culture, and Cognition The Society, Culture, and Cognition looks at human thought at a macro level. This discipline covers a huge variety of applications of Cognitive Science and has courses from lots of departments, including other CogSci disciplines. Courses you can ask us about: ECON 119, SOCIOL 150, POLISCI 161 LinkedIn Instagram Facebook YouTube Github TikTok © 2023 Berkeley CSSA Anonymous Feedback Form We are a student group acting independently of the University of California. We take full responsibility for our organization and this web site.",
    "status": "success"
  },
  {
    "name": "Computer Science Graduate Entrepreneurs (CSGE)",
    "website": "http://csge.berkeley.edu/",
    "eecs_summary": "Join the members-only mailing list by sending an email to sympa@lists.eecs.berkeley.edu with the following subject: subscribe csge-members@lists.eecs.berkeley The CSGE (Computer Science Graduate Entrepreneurs) is an organization for graduate students, alumni, and faculty of the Computer Science department at UC Berkeley. Our vision is a thriving culture of entrepreneurship in the department producing the world’s most influential startups and entrepreneurs. We work toward this goal by collecting and transferring ideas, experience, and connections from generation to generation of entrepreneurial Berkeley EECS graduate students and alumni.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "http://csge.berkeley.edu/",
    "has_about_page": false,
    "full_content": "Computer Science Graduate Entrepreneurs The CSGE (Computer Science Graduate Entrepreneurs) is a student organization for graduate students and alumni of the Computer Science department at UC Berkeley. Our vision is a thriving culture of entrepreneurship in the department that generates the world's most influential startups and entrepreneurs. We work toward this goal by collecting ideas, experience, and connections that transfer from generation to generation of entrepreneurial Berkeley CS graduate students and alumni. If you are a Graduate student or Alumni of Berkeley CS or EE, and interested in entrepreneurship, please: Join the CSGE grads mailing list csge.berkeley@gmail.com. Follow our social media on LinkedIn. Past Events Sky x CSGE: Dylan Patel, SemiAnalysis - GPU, AI, Entrepreneurship Sunday, October 5, 2025 Dylan's work is widely read across tech, finance, and policy circles for its sharp analysis of the companies, trends, and technologies shaping the future of computing. From GPUs powering AI breakthroughs to the global dynamics of the chip supply chain, Dylan brings a unique insider perspective at the intersection of technology, economics, and geopolitics. At this event, Dylan shared insights on: The rapidly evolving semiconductor industry and its impact on AI and the broader economy The competitive landscape among major chipmakers (NVIDIA, AMD, Intel, TSMC, and more) How AI workloads are reshaping hardware design and cloud infrastructure What these shifts mean for students, researchers, and future leaders in computing Sponsors",
    "status": "success"
  },
  {
    "name": "Computer Science Graduate Student Association (CSGSA)",
    "website": "http://csgsa.berkeley.edu",
    "eecs_summary": "csgsa@cs.berkeley.edu The Computer Science Graduate Student Association is the only student-run organization serving the CS graduate student community at Berkeley. The CSGSA sponsors orientation programs for new students, a number of academic and administrative services, and hosts a variety of social events throughout the year.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "",
    "has_about_page": false,
    "full_content": "",
    "status": "timeout"
  },
  {
    "name": "Computer Science KickStart (CSK)",
    "website": "http://cs-kickstart.berkeley.edu/",
    "eecs_summary": "apps.cskickstart@gmail.com CS KickStart is a one week introductory class in computer science designed for incoming freshman women at UC Berkeley. Participants learn how to program, learn about the different areas of computer science, and meet other computer science students.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "http://cs-kickstart.berkeley.edu/",
    "has_about_page": false,
    "full_content": "This website is unavailable. That could be due to maintenance, a technical glitch, or because it's been disabled. If you're the owner of this website and aren't sure why you're seeing this message, get in touch so we can help you out. This website is hosted by the Open Computing Facility, an all-volunteer student organization dedicated to free computing.",
    "status": "success"
  },
  {
    "name": "Computer Science Mentors (CSM)",
    "website": "https://csmentors.berkeley.edu",
    "eecs_summary": "mentors@berkeley.edu Computer Science Mentors is dedicated to UC Berkeley’s community of computer science educators and students. We provide academic and social support not only through various events, but also by offering aspiring educators mentorship, leadership, and teaching opportunities, and offering students supplementary sections (including for EE 16A) and one-on-one tutoring.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "https://csmentors.berkeley.edu",
    "has_about_page": false,
    "full_content": "StudentsMentorsPartnersTeamBiosEnroll in a SectionWe are CSMComputer Science Mentors for introductory electrical engineering and computer science courses at UC BerkeleyCS61ACS88CS61BCS61CCS70EECS16AEECS16B137+ Students Serviced94+ MentorsAverage mentor rating: 1.4/ 529% would come back to a CSM sessionWhat is CSM?CSM is a student-run organization that provides guidance and resources in a smaller classroom environment through group tutoring sessions. Each section has 4-6 students and focuses on material from one of the courses listed above. Outside of teaching, our mentors watch movies, climb up to Soda almost everyday, hike, study together, and more!Who we areWe are a group of UC Berkeley students passionate about teaching and helping students succeed in computer science. CSM provides a tiered system of mentoring opportunities. Senior Mentors write material and provide tips to Junior Mentors on how to teach. All mentors meet up once a week to learn from each other, and use another time of the week to teach a section. Our Associate Mentors are either tutors, readers, or other experienced teachers who teach a section without a Senior Mentor.Plan to join a section?JoinWant to be a mentor?ApplyWant to work with us?PartnerGive our Facebook page a like for updates and events!",
    "status": "success"
  },
  {
    "name": "Computer Science Undergraduate Association (CSUA)",
    "website": "http://csua.berkeley.edu/",
    "eecs_summary": "politburo@csua.berkeley.edu The CSUA is a social computer science club dedicated to supporting the undergraduate computer science student body. It provides social events, workshops, tech talks, and hackathons for students and works with companies to act as an entry point to industry.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "http://csua.berkeley.edu/officers/",
    "has_about_page": true,
    "full_content": "Aaryan Mehta OH: Thu 5-6 PM \"can you hear the music, robert\"",
    "status": "success"
  },
  {
    "name": "Data Science Society at Berkeley",
    "website": "https://dss.berkeley.edu/",
    "eecs_summary": "dss.berkeley@gmail.com Data Science Society at Berkeley is UC Berkeley’s first undergraduate student organization focused on Data Science. Established on the pillars of education, professional development, and community, Data Science Society has a long-standing record of helping students build their data science skills through learning opportunities and cultivating an academic and professional environment by connecting students with industry leaders and researchers. We have 5 teams helping us promote our mission: Academic Development Committee, Analytics Committee, DeCal Team, Career Development Committee, and our Culture Committee. We also have a General Membership program in which groups of General Members are mentored by the Academic Development Committee and work on a data science project of their choice.",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "https://dss.berkeley.edu/",
    "has_about_page": false,
    "full_content": "Index of / NameLast modifiedSizeDescription",
    "status": "minimal_content"
  },
  {
    "name": "Game Design and Development Club",
    "website": "https://gamedesign.studentorg.berkeley.edu/",
    "eecs_summary": "",
    "email": "executive@berkeleyanova.org",
    "scraped_url": "https://gamedesign.studentorg.berkeley.edu/",
    "has_about_page": false,
    "full_content": "Game Design Development at Berkeley An inviting community for Berkeley students interested in game design and development! Join Our Community Our Community Join Cal's Game Design and Development Club to connect with fellow gamers. Whether you're a student, alumni, or have taken the decal, you're all welcome. Apply for a role, build a game team, and get mentorship from peers. We'll also host hackathons and guest speakers. Join us - we'd love to have you! Learn more Linktree Discord Decal Our Video Game Design and Development Decal covers game creation from start to finish. Throughout the semester, students will pitch a game, form teams, and complete a project with instructor guidance. No prior game development experience is necessary, but basic art, music, or programming skills are required. Learn more Featured Events Previous Next Check out our events! Try out some GDD games! Switch Project Pirate The Missing Can You Picture Heaven? Relica Father's Crematoria Danger: Lurkers Dinner in the Closet Operation Aptitude Spaceship Showdown Sushi Bar Bookshelf Badger Gravitas Arcade Aperture Rythmic Blade Plague Village Home for Anderson GDD F23 Adventure Game Neolithic Combat Groundhog Night Rat in the Trap First Contact LampLight Out of Sight Interwoven Stranded Bakery: After Life Oski Party Sword King Roboto's Escape ShipHex Stranded Catharsis [ME][TA]L Package Runner 20xx Idol K-atcher The Archetype Syndicate Fiery and Icy Pigmental v.0 Interwoven The Blacksmith's Legacy Passing The Apartment Spermulator Repellion Don't Wake Up G.B.O Barkeley freeze() Cheese Fighter pengWIN StamPunk Super Squeak Fighter v.0 Ööber CollegeSim Bear's Bobaria RotoR Boo's A Crowd Gaslight Gatekeep Girlboss BearWALK: The Game Rat Sleuth Party Bears You are the Shopkeeper in an RPG Lucid Glade of the Gray Caillou Goes to Cal Cavern Blitz CODA By A Thread Homestead Hero The Great Sword of Everything Stonekeeper Synergetica Slime Attack Paper Cranes Polydrome Oravia Forgotten Tomb Furniture Dating Desolate Dragon Unnatural Selection Attack of the Boba Vampires Nevaia Deep State Big Bang Blaster Into the Dating Sim Steal the Spotlight Clone On Stolen Time Whisper of Souls Don't Talk to the Wizard Kitsu Tama Ghost Quest: The Phantom Game The Search For Questionable Content Within Me Jerry Mander: The Rise And Fall Of The American Dream Bondfire Goodnight, Lucid Dream CyberRunner Zombie Football! Dusk Island Radical Jumper S'witch SEED Hue Jack of All Blades Palette Town LEAVE One Man's Sky L.A.S.E.R. Roll-ette Hyper Strike Loot Dungeon Murderhobos Planemo Shrouded by Darkness The Black Swordsman Too Many Cooks Zosar Casuality Hacking More Games",
    "status": "success"
  },
  {
    "name": "Generative AI at Berkeley",
    "website": "https://www.berkeleygenai.com/",
    "eecs_summary": "berkeleygenai@gmail.com Generative AI at Berkeley is the biggest Generative AI student organization at UC Berkeley. We focus on exploring the groundbreaking field of Generative AI as well as its transformative potential applications. Members collaborate on diverse projects that combine technical and creative work: applying cutting-edge technologies such as Stable Diffusion and LLMs to real-world problems or exploring new forms of artistic expression through multi-modal AI. We offer a space for anyone simply seeking to learn more about Generative AI and find others who share that interest. Whether you are a coder, artist, musician, or anyone else, this club offers an inclusive and social space for anyone curious about the limitless possibilities of Generative AI.",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "",
    "has_about_page": false,
    "full_content": "",
    "status": "timeout"
  },
  {
    "name": "Hackers at Berkeley (HACK)",
    "website": "http://hackersatberkeley.com/",
    "eecs_summary": "ir@hackersatberkeley.com Hackers at Berkeley is an organization that fosters a culture of creation at Berkeley. It strives to encourage, stimulate, and maintain excellence in scholarship of its members in all fields, particularly in software engineering, and to advance the art of ethical software development.",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "http://hackersatberkeley.com/about.html",
    "has_about_page": true,
    "full_content": "Our Team Aakash Adesara #SOLID Amit Talreja \"It’s not a bug, it’s a feature.\" Archita Jain \"How do you tell an algorithm you're laughing at it, not with it?\" - David Rees Asena Yildiz \"The grass is always greener on the other sky.\" - Rodney Ingrid Wu \"The grass is always greener on the other sky.\" - Rodney Jackson Stogel \"The grass is always greener on the other sky.\" - Rodney Jessie Yang \"If you have multiple sewing machines running at once, is that multithreading?\" Kevin Tran \"It's not as easy as it looks to be this H@Bulous all the time. \" Legeng Liu *has strong understanding of cs theory* *won't tell you about my startup idea at all* *p=np* Luke Brody \"I love H@B...as a friend.\" Lulu Wang I like to design worlds. hmu for pro art tipz Maitri Shah \"Life ain't picture perfect we use the negatives to develop.\" - Logic Nate Young \"The grass is always greener on the other sky.\" - Rodney Netra Sathe I stayed at a hotel where at breakfast the chef asked me how \"how would you like your eggs?\", and I said \"in a cake\" Ryan Lee \"My name was trending on Twitter that one time I was getting exponential growth. Then again, that might have been about one of those other non-technical Ryans.\"",
    "status": "success"
  },
  {
    "name": "Hack the Bay (CalHacks)",
    "website": "http://www.calhacks.io/",
    "eecs_summary": "team@calhacks.io Cal Hacks organizes and runs large-scale computer science and technology entrepreneurship related events",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "http://www.calhacks.io/#about",
    "has_about_page": true,
    "full_content": "BECOME A HACKERregular due oct 01OCT 24 – 262025PALACE OF FINE ARTS@ SAN FRANCISCO, CA",
    "status": "success"
  },
  {
    "name": "Launchpad",
    "website": "https://launchpad.berkeley.edu/",
    "eecs_summary": "team@callaunchpad.org Launchpad is a project-based organization that develops applications using artificial intelligence and machine learning. Our members work on projects such as music generation, image and music classification, and reinforcement learning in robotics. We also like to hold external events to contribute to the general Berkeley CS community. Our vision is to turn the theory students learn from intelligent software classes into real applications that teams can take ownership of.",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "https://launchpad.berkeley.edu/about",
    "has_about_page": true,
    "full_content": "About Building a community of problem solvers with intelligent software",
    "status": "success"
  },
  {
    "name": "Mobile Developers of Berkeley (MDB)",
    "website": "https://mdb.dev/",
    "eecs_summary": "contact@mobiledevsberkeley.org MDB provides a collaborative environment for members to grow their technical skills while building the next generation of software products. Our dev cycle is designed to produce the best environment for our members to build cutting-edge apps. Through weekly workshops and major events, it provides a framework to guide our teams to success. Along each stage of the cycle, our teams receive support from mentors and industry advisors. Each team has access to a wealth of resources such as professional software, technical assistance, marketing outlets, and funding.",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "https://mdb.dev/about",
    "has_about_page": true,
    "full_content": "About UsMobile Developers of Berkeley is a dynamic tech club at UC Berkeley, founded in 2015, dedicated to mobile/full-stack development and fostering a vibrant community. We bring together passionate developers, designers, and innovators to create impactful projects for startups and learn from each other through club hackshops, training programs, and collaborative events.Our mission is to provide hands-on experience in mobile and web development while building lasting friendships and professional connections. Whether you're a seasoned developer or just starting your coding journey, MDB offers a supportive environment to grow your skills and make meaningful contributions to real-world projects.ProjectsWe take 3 client projects each semester, ranging from Mobile to Web to ML to Game Dev, our members are passionate about many fields and ready to tackle any problemLearn More →Training ProgramA 13 week intensive program, we teach you the basics of full-stack development, culminating in a newbie app fully ideated and created by the new member class, which is published on the App StoreLearn More →CommunityWe love our MDB Community!! It is the most important part of the club, and is essential to who we are. From social, to study sessions, to retreat, we truly believe in creating a welcoming and supportive community for our members to suit all their needs.MDBaddi|Lafayette Square Contract TeamPM Edan planning out our W against CodebaseMDB Picnic at the GladeMDB Banquet DinnerRiding the Superman at Six FlagsMDB in Hawaii, Kevin's CarSt. Patty's Day!Wine and Cheese Night!Noah our beloved 2024-2025 PresidentJeff's Lineage - MDB LegacyNewbie Hike!Lafayette Square Contract TeamPM Edan planning out our W against CodebaseMDB Picnic at the GladeMDB Banquet DinnerRiding the Superman at Six FlagsMDB in Hawaii, Kevin's CarSt. Patty's Day!Wine and Cheese Night!Noah our beloved 2024-2025 PresidentJeff's Lineage - MDB LegacyNewbie Hike!Lafayette Square Contract TeamPM Edan planning out our W against CodebaseMDB Picnic at the GladeMDB Banquet DinnerRiding the Superman at Six FlagsMDB in Hawaii, Kevin's CarSt. Patty's Day!Wine and Cheese Night!Noah our beloved 2024-2025 PresidentJeff's Lineage - MDB LegacyNewbie Hike!MDB LShip GOATs.GOOOOOOOOOOOOOOOOOOOOOL8-Ball, Jai taking the L against RianaWelcome Back Night (Chryssa, Morrell, Elisa, Sarah)Circuit Contract TeamMDB Banquet DinnerMDB HAWAII RETREAT SPRING 2025MDB in Hawaii, Preston's CarMobile Developers of BerkeleyProject Manager Team Spring 2025MDB Selfie @The JokerMDB LShip GOATs.GOOOOOOOOOOOOOOOOOOOOOL8-Ball, Jai taking the L against RianaWelcome Back Night (Chryssa, Morrell, Elisa, Sarah)Circuit Contract TeamMDB Banquet DinnerMDB HAWAII RETREAT SPRING 2025MDB in Hawaii, Preston's CarMobile Developers of BerkeleyProject Manager Team Spring 2025MDB Selfie @The JokerMDB LShip GOATs.GOOOOOOOOOOOOOOOOOOOOOL8-Ball, Jai taking the L against RianaWelcome Back Night (Chryssa, Morrell, Elisa, Sarah)Circuit Contract TeamMDB Banquet DinnerMDB HAWAII RETREAT SPRING 2025MDB in Hawaii, Preston's CarMobile Developers of BerkeleyProject Manager Team Spring 2025MDB Selfie @The JokerGit Lit? Got Lit.MDB supporting our IM Soccer TeamTP Instructor MO ending the semester with a bangWelcome Back Night (Cathryn, Angie, Val, Renata, Emma, Danica)Sur Contract TeamNewbie Night <3MDB @Six FlagsMDB in Hawaii, Mike's CarEdan and his Little AlpMDB Banquet DinnerGit Lit? Got Lit.MDB supporting our IM Soccer TeamTP Instructor MO ending the semester with a bangWelcome Back Night (Cathryn, Angie, Val, Renata, Emma, Danica)Sur Contract TeamNewbie Night <3MDB @Six FlagsMDB in Hawaii, Mike's CarEdan and his Little AlpMDB Banquet DinnerGit Lit? Got Lit.MDB supporting our IM Soccer TeamTP Instructor MO ending the semester with a bangWelcome Back Night (Cathryn, Angie, Val, Renata, Emma, Danica)Sur Contract TeamNewbie Night <3MDB @Six FlagsMDB in Hawaii, Mike's CarEdan and his Little AlpMDB Banquet DinnerLeadershipMike GuerreroPresidentBonnie WangVP of OperationsPavithra Arun AnandVP of OperationsRia TaoVP of InternalAarav DesaiVP of InternalDaniel GilVP of ProjectsSodbayar GanbatVP of ProjectsRiana MistryVP of EducationTina YeVP of MarketingProject ManagersDylan DangProject ManagerLandy ManzaneroProject ManagerLara ChieppeProject ManagerSophia ClancyProject ManagerMembersAiji LiMemberAlex KimMemberAngie ZhuMemberAlp SenayMemberArnav KhinvasaraMemberCathryn ChangMemberChristy CheungMemberChryssa VamvakaMemberEdan GortzakMemberEmma FethMemberEvan JohnsonMemberHenry BonomoloMemberJoey WongMemberJulia DuanMemberKaavya MahendranMemberMandy PhamMemberNaila TalibMemberNitya KuppireddyMemberNomin-Erdene BatchuluunMemberRenata Martinez CamargoMemberRhea MinglaniMemberSarah ZongMemberShweta SurendarMemberValerie EngMember",
    "status": "success"
  },
  {
    "name": "Open Computing Facility (OCF)",
    "website": "http://www.ocf.berkeley.edu/",
    "eecs_summary": "help@ocf.berkeley.edu The OCF is a student-run, student-funded organization and is dedicated to free computing for all University of California at Berkeley students, faculty, and staff. The mission of the OCF is to provide an environment where no member of Berkeley’s campus community is denied the computer resources he or she seeks, to appeal to all members of the Berkeley campus community with unsatisfied computing needs, and to provide a place for those interested in computing so that they can fully explore that interest.",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "http://www.ocf.berkeley.edu/docs/about/",
    "has_about_page": true,
    "full_content": "The mission The OCF is an all-volunteer, student-run, Chartered Program of the Associated Students of the University of California (ASUC) dedicated to free computing for all University of California at Berkeley students, faculty, and staff. The mission of the OCF is to provide an environment where no member of Berkeley's campus community is denied the computer resources they seek, to appeal to all members of the Berkeley campus community with unsatisfied computing needs, and to provide a place for those interested in computing to fully explore that interest. What do we do? The Open Computing Facility provides free computing services to students, faculty, and staff, ranging from printing to expiration-free web hosting to Unix shell accounts to email. Furthermore, the OCF operates a highly frequented long-hours computer lab with a generally high volunteer-staff-to-user ratio for accessible in-person support, as well as online support. In addition to these user services, the group also hosts numerous student group and faculty/staff websites, and provides support to these and other organizations on campus. To be able to do this, we are always aiming to secure more resources to fully meet the needs of everyone in the campus community. Our primary resources are our GNU/Linux workstations and servers, entirely administered by student volunteers. These resources are located within our computing lab on the ground floor of MLK Student Union. To help people explore the field of computing and educate them about the resources available, the OCF also provides a variety of educational services. We used to co-sponsor a series of Help Sessions, short classes taught throughout the semester on a wide range of computing topics (focusing on resources available to the Berkeley campus community), along with hosting the UNIX SysAdmin DeCal. Additionally, the OCF used to conduct career fairs in the past with its sister organization, the Computer Science Undergraduate Association. Now, we host regular Tech Talks that explore new technologies and how they might pertain to elements of the OCF infrastructure. We also offer e-mail and in-person with our volunteer staff members, as well as online sources of information about computing on the Berkeley campus and how to use the available resources. Policies for this cluster and decisions for the OCF organization are made by the OCF Board of Directors, an open body composed of OCF members who are interested in participating in the decision-making process. The Board convenes at BoD Meetings, held every week when classes are in session, which are open to the public and provide a chance for any user to express their concerns or opinions about the OCF. All OCF members are welcome to join the Board of Directors, and the general public is welcome to attend BoD Meetings. Minutes of all previous meetings are available online. How to find us The OCF is located on the ground floor of MLK Student Union. For hours and a map, see here. If you need to contact OCF staff members, you may send us an email The Open Computing Facility is a student group acting independently of the University of California. We take full responsibility for our organization and this website. Edit this Page Page History More in this category About us Officers Where alumni have gone",
    "status": "success"
  },
  {
    "name": "Philosophy of Computation at Berkeley (POCAB)",
    "website": "https://pocab.wordpress.com/",
    "eecs_summary": "berkeleypoc@gmail.com We are a group of students working towards computer science as an end in itself, software engineers who think deeply about ethics, and radically cross-disciplinary trains of thought. We talk about things like culture and paradoxes, brain development and computation, P vs. NP, and how to make robots that would not try to destroy humanity. We are offering a DeCal, “The Poetry of Computer Science, the Computer Science of Poetry: Philosophy of Computation” in Fall 2017! Like our Facebook page at https://pocab.wordpress.com/ to stay updated.",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "https://pocab.wordpress.com/home/about/",
    "has_about_page": true,
    "full_content": "When the word “computer science” is uttered, few people think of philosophy or poetry. Similarly, few people know that the “father of computer science”, Alan Turing, was also a philosopher, or that the “mother of computer science”, Ada Lovelace, was also a poet. Amongst the glamour and wads of cash at nearby Silicon Valley, the history of computer science is rarely discussed, and the motivations of major thinkers frequently forgotten. This is a shame, because what motivated these thinkers were in fact not money nor glamour but some of the most universal, basic, visceral questions such as I propose to consider the question, can machines think? (Alan Turing) Advertisement[I will have] the most harmoniously disciplined troops; – consisting of vast numbers, and marching in irresistible power to the sound of Music. Is not this very mysterious?…But then, what are these Numbers? There is a riddle – (Ada Lovelace, at her deathbed) The neglect of philosophical motivations is doubly a shame because, decades since its founders’ deaths, computer science has steadily advanced its light, and we are now in a much better position to start answering these questions! Some ideas from theoretical computer science, such as uncomputability, P vs. NP, and quantum computing, have slowly seeped into such diverse areas of thought as child development, strange loops, language, evolution, culture, epistemology, metaphysics, morality, and on and on. But the idea that computer science has philosophical roots and implications has been slow to be snuggled into the cultural zeitgeist. AdvertisementWe lament not so much the lack of discussion on the philosophy of computation, but the lack of awareness that such discussions are even possible. Because of the lack of awareness, computer science is instead frequently viewed as materialistic, elitist, and a means to an end. We want to foster an academic culture where a sizable portion of students are actively talking about the philosophy of computation, so that computer science becomes more of an end in itself. We believe such a culture will not only provide a major motivation to study computer science for many more people, but also make the department more welcoming to people of diverse backgrounds, diverse viewpoints, and diverse areas of focus and competence. But what’s so special about the philsophy of computation, and why should anyone care? After all, philosophy is abstruse and elitist, and has nothing to do with our lives anyway. We believe computation as a lens for asking philosophical questions is unique in that it is quantitative, formal, and exact. Because the lens is mathematical and thus universal, diverse cultural viewpoints can be respected and understood – a major problem in philosophy, currently plagued by a glaring diversity problem. AdvertisementAnother compelling reason is that, probably sometime soon, everybody will have to deal with the philosophical implications of computation: some seventy years since Turing posed his question, Can machines think?, an answer is now approaching us at a seemingly relentless pace. And then there’s the exciting part, of course, that the computational lens leads to completely unexpected answers to our philosophical questions, answers that threaten to turn our intuitions about the world completely upside down. We are a student organization and nonprofit based at the University of California, Berkeley, dedicated to furthering the philosophy of computation. We are not armchair philosophers. On the contrary: in this moment of political crisis, we seek to lead the direction of contemporary political discourse with fresh new interdisciplinary ideas. AdvertisementShare this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading... Leave a comment Cancel reply Δ",
    "status": "success"
  },
  {
    "name": "UC Berkeley Undergraduate Graphics Group (UCBUGG)",
    "website": "http://www.ucbugg.com/",
    "eecs_summary": "staff[AT]ucbugg[DOT]com The UC Berkeley Undergraduate Graphics Group is a casual bunch of students at Berkeley who want to introduce our fellow students to the process of producing a 3D animated short film. The course is offered through Democratic Education at Cal.",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "http://www.ucbugg.com/about",
    "has_about_page": true,
    "full_content": "UCBUGG3D Modeling& AnimationHOMESYLLABUSLABSABOUTxxxHOMESYLLABUSLABSABOUTUCBUGGUniversity of California Berkeley Undergraduate Graphics GroupWho we areThe UC Berkeley Undergraduate Graphics Group (UCBUGG) is a group of passionate students who want to introduce our fellow peers to the art of creating a 3D-animated short film. We run the UCBUGG DeCal, offering both a basic and advanced curriculum. This DeCal guides students of all skill levels through the entire production pipeline of creating an animated film, using software like Autodesk Maya, Adobe After Effects, and Pixar's Renderman. UCBUGG alumni have broke into the industry, working at places like Dreamworks, Pixar, and Sony EntertainmentThe Animation PipelineStoryboardingModelingShadingRiggingAnimatingCompositingStoryboardingStoryboarding is the process of drafting out a sketch of your film through a series of small images. They can range from being incredibly detailed to being simple stick figures! The goal is to get a sense of what the final film is going to look like and for future animators to use it as reference. Storyboards also help realize how camera angles, zooming, panning, and overall shot composition works, allowing for a rapid way to revise and edit before anything is finalized.❮❯ScheduleMonday or Wednesday7:00 - 9:00pmSoda 330",
    "status": "success"
  },
  {
    "name": "Undergraduate Group for Theoretical Computer Science (UGTCS)",
    "website": "https://ugtcs.berkeley.edu/",
    "eecs_summary": "Contact UGTC Give students interested in theoretical computing the resources to better their knowledge and interact with students with similar interests.",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "https://ugtcs.berkeley.edu/",
    "has_about_page": false,
    "full_content": "An inclusive undergraduate CS Theory community at Berkeley Get Involved",
    "status": "success"
  },
  {
    "name": "Upsilon Pi Epsilon (UPE) Computer Science Honor Society",
    "website": "https://callink.berkeley.edu/organization/upe",
    "eecs_summary": "officers@upe.berkeley.edu Upsilon Pi Epsilon is the first and only international honor society for the Computing Sciences. The Nu chapter of UPE at UC Berkeley was founded in 1995 and continues to serve Computer Science undergraduate students in the College of Letters and Science. We are committed in promoting more social interaction and communication, and relationship between undergraduate students, faculty, and industry in the computing discipline. We identify with academic excellence, and work to assist undergraduate computer science students with opportunities which are otherwise not available in the curriculum. We offer assistance in lower-division labs, luncheons with faculty members, info-sessions from the industry, and a variety of social events every semester.",
    "email": "calgamedesign@gmail.com",
    "scraped_url": "https://callink.berkeley.edu/organization/upe",
    "has_about_page": false,
    "full_content": "Upsilon Pi EpsilonAboutUpsilon Pi Epsilon (UPE) is the international computer science honor society backed by both ACM and IEEE. The Nu Chapter is the premier computer science society at Berkeley and provides professional development services, workshops, and events to the student community Contact Information Address 346 Soda Hall Berkeley, CA 94720-1776 United States Contact Email E: info@upe.berkeley.edu Additional Information INFORMATION ABOUT HOW TO GET INVOLVED WITH THIS ORGANIZATION IS FOUND HERE We are a computer science honor society. The EECS department at Berkeley sends us a name list of all the students who have declared computer science major and ranked the top third in computer science. We will send invitation emails directly to students on the name list with an application form. Info-sessions will also be held at the beginning of each semester. For any questions about getting involved, please contact us via Facebook https://www.facebook.com/ucbupe or email info@upe.berkeley.edu.Find information below about the OASIS Center organization category and who the administration contact is (see https://lead.berkeley.edu/meet-our-staff/):Callink DesignationOASIS Category: Engineering/Computer Science RSOUndergraduate/Graduate Student CompositionUndergraduate Students Primary Campus AdvisorMelissa Landeros at melissalanderos@berkeley.eduAdditional Advisor, if applicable. Some groups benefit from having assigned advisors across units. This relationship can be informal or formal. If formal, the advisor name appears here:Not ApplicableContactPublic EventsThere are currently no upcoming events. View past events.View More EventsSign In To View OfficersDocumentsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsConstitution/BylawsView All Documents",
    "status": "success"
  },
  {
    "name": "Society of Women Engineers (SWE)",
    "website": "https://swe.berkeley.edu/",
    "eecs_summary": "swe.berkeley@gmail.com Society of Women Engineers is a national nonprofit organization. SIts objective is to encourage and empower women to reach their full potential as engineers. SWE strives to highlight the achievements and contributions of women as leaders and engineers. Supporting both students and professionals, SWE consists of over 17,000 members in 90 sections and 300 student sections. The UC Berkeley student chapter has been established since 1975 and supports students through professional development, social events and outreach to young women interested in the STEM field.",
    "email": "swe.berkeley@gmail.com",
    "scraped_url": "https://swe.berkeley.edu/about.html",
    "has_about_page": true,
    "full_content": "Our SWE Section Mission The UC Berkeley SWE section strives to support the next generation of women and non-binary engineers by: providing professional development resources and networking opportunities to help students navigate the start of their careers; hosting socials to connect engineers with others in their area of study; organizing STEM advocacy and inclusion workshops, encouraging both women and non-binary engineers and allies to fight for an equitable workplace; and leading outreach programs for local K-12 students — geared especially towards underrepresented youth — to help them learn more about STEM. Awards Gold FY10: Strategic Communications Print Newsletter FY16: Outstanding Collegiate Section FY17: Outstanding Collegiate Section FY18: Outstanding Collegiate Section FY19: Outstanding Collegiate Section FY20: Outstanding Collegiate Section FY21: Outstanding Collegiate Section FY22: Outstanding Collegiate Section FY23: Outstanding Collegiate Section FY24: Outstanding Collegiate Section Silver FY10: Outstanding Collegiate Section FY13: Outstanding Collegiate Section Other FY19: 1st Place Team Tech Competition FY19: SWE Advocacy FY20: Best Practice: Multicultural FY20: Best Practice: Partnerships with Collegiates, Professionals, Industry and Academia FY21: Best Practice: Multicultural Land Acknowledgement UC Berkeley SWE acknowledges that UC Berkeley sits on the territory of xučyun (Huichin), the ancestral and unceded land of the Chochenyo speaking Ohlone people, the successors of the sovereign Verona Band of Alameda County. We recognize that every member of the Berkeley community has, and continues to benefit from, the use and occupation of this land, since the institution's founding in 1868. Consistent with our values of community, inclusion, and diversity, we have a responsibility to acknowledge and make visible the university's relationship to Native peoples. As members of the Berkeley community, it is vitally important that we not only recognize the history of the land on which we stand but also, we recognize that the Muwekma Ohlone people are alive and flourishing members of the Berkeley and broader Bay Area communities today. FAQ What opportunities does SWE provide for UC Berkeley students? SWE organizes many different events for students throughout the semester. We hold infosessions and career workshops with our sponsors, giving students the unique opportunity to network with industry leaders and professionals. There are also volunteer opportunities through our various outreach programs. Furthermore, we have socials and hangouts for members to come and have fun together. We also can't forget about our advocacy, equity, and inclusion focused workshops! To stay up to date with all the latest events, sign up for our weekly SWEmails! What opportunities does SWE provide for elementary, middle school, and high school students? SWE has many different outreach programs for all elementary, middle school, high school, and prospective students. To learn more about them visit our outreach page. Who can join? SWE is open to all UC Berkeley students who are interested! Our members come from a diverse background of engineers and other STEM-related fields. Regardless of major, gender, and identities, SWE is an inclusive space for anyone who is passionate about Gender Equality in STEM. How can I get involved in SWE? The best way to get involved is to become a committee member and/or apprentice. Our committee applications open at our first General Meeting of the semester. Our officer applications open towards the end of every semester. To learn more about each position visit our get involved page. Our company is interested in partnering with SWE. Where do we start? We're excited to have you join us! You can view our corporate package and learn more at our corporate page. More questions? You can email us at swe.berkeley@gmail.com for any of your inquiries. We try to respond as soon as possible.",
    "status": "success"
  }
]